# Groupby

The groupby method allows you to group rows of data together and call aggregate functions

In [2]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [5]:
import pandas as pd 
data1 = {'company': ['goog', 'goog', 'goog','msft', 'msft', 'fb', 'fb'], 
       'person': ['sam', 'charlie', 'bob','amy', 'vanessa', 'carl', 'sarah'],
       'sales': [200, 120, 230, 340, 124, 243, 350]}

In [6]:
df = pd.DataFrame(data1)

In [10]:
df

  company   person  sales
0    goog      sam    200
1    goog  charlie    120
2    goog      bob    230
3    msft      amy    340
4    msft  vanessa    124
5      fb     carl    243
6      fb    sarah    350

In [14]:
df['sales'].mean()

229.57142857142858

In [15]:
df['sales'].quantile(q=0.5)

230.0

In [16]:
df['sales'].quantile(q=0.9)

344.0

In [18]:
by_cmp = df.groupby(['company', 'person'])
# by_cmp.mean()
a = by_cmp.describe()
a

                sales
                count   mean std    min    25%    50%    75%    max
company person
fb      carl      1.0  243.0 NaN  243.0  243.0  243.0  243.0  243.0
        sarah     1.0  350.0 NaN  350.0  350.0  350.0  350.0  350.0
goog    bob       1.0  230.0 NaN  230.0  230.0  230.0  230.0  230.0
        charlie   1.0  120.0 NaN  120.0  120.0  120.0  120.0  120.0
        sam       1.0  200.0 NaN  200.0  200.0  200.0  200.0  200.0
msft    amy       1.0  340.0 NaN  340.0  340.0  340.0  340.0  340.0
        vanessa   1.0  124.0 NaN  124.0  124.0  124.0  124.0  124.0

In [31]:
df1 = pd.DataFrame(
           {'indicator': ['indicator 1', 'indicator 1', 'indicator 2', 'indicator 2'],
            'year':[2014,2014,2015,2015],
            'value type': ['upper', 'lower', 'upper', 'lower'],
            'value':[12.3, 10.2, 15.4, 13.2]
           },
           index=[1,2,3,4])
df1

     indicator  year value type  value
1  indicator 1  2014      upper   12.3
2  indicator 1  2014      lower   10.2
3  indicator 2  2015      upper   15.4
4  indicator 2  2015      lower   13.2

In [34]:
df['mean'] = df.groupby('indicator')['value'].transform('mean')
# df['sum-of'] = df.groupby('code')['value'].transform('mean')

In [35]:
df

     indicator  year value type  value   mean
1  indicator 1  2014      upper  11.25  11.25
2  indicator 1  2014      lower  11.25  11.25
3  indicator 2  2015      upper  14.30  14.30
4  indicator 2  2015      lower  14.30  14.30

In [28]:
df.groupby('company')

You can save this object as a new variable:

In [29]:
by_comp = df.groupby("company")

And then call aggregate methods off the object:

In [30]:
by_comp.describe()

        sales
        count        mean         std    min     25%    50%     75%    max
company
fb        2.0  296.500000   75.660426  243.0  269.75  296.5  323.25  350.0
goog      3.0  183.333333   56.862407  120.0  160.00  200.0  215.00  230.0
msft      2.0  232.000000  152.735065  124.0  178.00  232.0  286.00  340.0

In [32]:
df.groupby('company').mean()

              sales
company
fb       296.500000
goog     183.333333
msft     232.000000

More examples of aggregate methods:

Standard deviation

In [34]:
by_comp.std()

              sales
company
fb        75.660426
goog      56.862407
msft     152.735065

In [35]:
by_comp.min()

        person  sales
company
fb        carl    243
goog       bob    120
msft       amy    124

In [36]:
by_comp.max()

          person  sales
company
fb         sarah    350
goog         sam    230
msft     vanessa    340

In [37]:
by_comp.count()

         person  sales
company
fb            2      2
goog          3      3
msft          2      2

In [39]:
by_comp.describe()

        sales
        count        mean         std    min     25%    50%     75%    max
company
fb        2.0  296.500000   75.660426  243.0  269.75  296.5  323.25  350.0
goog      3.0  183.333333   56.862407  120.0  160.00  200.0  215.00  230.0
msft      2.0  232.000000  152.735065  124.0  178.00  232.0  286.00  340.0

Flips a matrix over its diagonal

In [41]:
by_comp.describe().transpose()

company              fb        goog        msft
sales count    2.000000    3.000000    2.000000
      mean   296.500000  183.333333  232.000000
      std     75.660426   56.862407  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  160.000000  178.000000
      50%    296.500000  200.000000  232.000000
      75%    323.250000  215.000000  286.000000
      max    350.000000  230.000000  340.000000

In [44]:
by_comp.describe().transpose()['goog']

sales  count      3.000000
       mean     183.333333
       std       56.862407
       min      120.000000
       25%      160.000000
       50%      200.000000
       75%      215.000000
       max      230.000000
Name: goog, dtype: float64